[
	{
		"name": "A Simple Chess Game",
		"summary": "This is a chess game for iPhone devices that supports 2 player gameplay, in order to play against your friend.",
		"responsibilities": [
				"Everything"
			],
		"tags": "Objective-C, iOS",
		"feature": "featureASChess.jpg",
		"icon": "iconASChess.png",
		"sampleCode": "https://github.com/SpiritBreaker226/asimplechessgame",
		"TeamSize": 1,
		"Platforms": "iOS",
		"projectType": "Open",
		"projectURL": "",
		"projectStartDate": "2014-07-08",
		"projectEndDate": ""
	},
	{
		"name": "Elementary Teachers of Toronto",
		"summary": "Worked with a partner company (design vendor) to develop the frontend of the site using WordPress as the backbone, which supported the integration with their current organizational structure.",
		"responsibilities": [
			"Lead Developer on the project",
			"Developed the backend member data management system to support the growth and marketing initiatives of ETT organization and re-engineered WordPress so that multiple plugins can post onto the website.",
			"Developed a different type of post, such as an event post which would have a different layout than that of a news post, where both needed to be displayed on the homepage. Add in code that would use the same data and layout but would detect if there was a file for different post type.  If so, then the function would send the data over to that file and use it instead."
			],
		"tags": "Wordpress, PHP, mySQL, Javascript, CSS, HTML",
		"feature": "featureETT.jpg",
		"icon": "iconETT.png",
		"sampleCode": "https://github.com/SpiritBreaker226/codesamples-ETT",
		"TeamSize": 2,
		"Platforms": "Web",
		"projectType": "Close",
		"projectURL": "http://ett.ca",
		"projectStartDate": "2012-07-16",
		"projectEndDate": "2013-12-16"
	},
	{
		"name": "Oxford Properties Recycling Game",
		"summary": "Developed an iPad game for Oxford Properties to promote recycling and sustainability in their buildings. Gave the tenants a fun way of learning what is recyclable.",
		"responsibilities": [
				"Lead Developer on the project",
				"Developed an image uploader and manager component that keeps track of the user's image that they uploaded for either their obituary or funeral home.",
				"Developed the approval process when a funeral home makes a change to their profile. It needs to be approved before it goes live to the site. This includes both text and images.",
				"Created a connection to WordPress to DotNetNuke a C# CMS to display blogs from WordPress."
			],
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, Phonegap",
		"feature": "featureOxford.jpg",
		"icon": "iconOxford.png",
		"sampleCode": "https://github.com/SpiritBreaker226/codesamples-Oxford-RecyclingKiosk",
		"TeamSize": 2,
		"Platforms": "iOS",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2011-11-01",
		"projectEndDate": "2014-08-18"
	},
	{
		"name": "GeriatRx Pharmacy",
		"summary": "Allows a doctor to view a patient's history, drug interactions, as well as enter their patient's prescriptions, from a tablet.",
		"responsibilities": [
				"Lead Developer on the project",
				"Worked on the styling and most of the coding. This app is able to search by patient’s name and by drugs. The doctor can authorize by signing a prescription on the app. A PDF is automatically sent to the doctor and patient.",
				"The process of finding the patient and drugs was time consuming by creating an instant search for patients and drugs this cuts the process time in half and allows the doctors to quickly prescribe prescriptions to their patients more quickly."
			],
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, Phonegap",
		"feature": "featureGeriatRx.jpg",
		"icon": "iconGeriatRx.png",
		"sampleCode": "",
		"TeamSize": 2,
		"Platforms": "iOS",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2013-04-03",
		"projectEndDate": "2014-04-21"
	},
	{
		"name": "Ontario Liberal Party",
		"summary": "Implementation of two new content-managed websites for Ontario Liberal Party. Short timeline and rapid execution was performed to release the new website for September 2010 and September 2011. First website accommodated the DotNetNuke CMS engine and second website performed custom integration with OLP internal web services that were utilized as data source.",
		"responsibilities": [
				"Sole Developer on the project.  Other team members were a designer and Q&A testers.", 
				"For the video section there are two RSS feeds, YouTube and Vimeo. Created a way to read and display the videos for those feeds.", 
				"Created a function to read a non-web standard from their non-standard XML stream and converted it over to be read onto the website. This resulted in internal data being displayed on their website, meaning less administration on the website."
			],
		"tags": "C#, Javascript, CSS, HTML, SQL Server, DotNetNuke, XML",
		"feature": "featureOLP.jpg",
		"icon": "iconOLP.png",
		"sampleCode": "",
		"TeamSize": 4,
		"Platforms": "Web",
		"projectType": "Close",
		"projectURL": "http://ontarioliberal.ca",
		"projectStartDate": "2010-08-04",
		"projectEndDate": "2011-09-04"
	},
	{
		"name": "theObituaries.ca",
		"summary": "A site that gives you the opportunity to create an obituary or memorial for a friend or family member. You can also share obituaries on Facebook or Twitter.",
		"responsibilities": [
				"Lead Developer on the project",
				"Masterminded the implementation of the design, local database and game algorithm on a tight deadline.",
				"Developed the deployment plan and trained the client on installation and reporting procedure.",
				"Mentored junior developers on the game procedure and maintenance.",
				"Added drag and drop function in order to allow the user in the game, to move the trash into the proper bins, then award points if they are correct.",
				"The game also needed to be bilingual. Added in a JSON file with all of the text for the game in both English and French, which allows the game not only to be in two languages but allows for further expansion into other languages, if necessary."
			],
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, DotNetNuke, PHP, mySQL, WordPress",
		"feature": "featureObituaries.jpg",
		"icon": "iconObituaries.png",
		"sampleCode": "https://github.com/SpiritBreaker226/codesamples-theobituaries",
		"TeamSize": 5,
		"Platforms": "Web",
		"projectType": "Close",
		"projectURL": "http://theobituaries.ca",
		"projectStartDate": "2013-02-12",
		"projectEndDate": "2013-09-16"
	},
	{
		"name": "Chatr Wireless",
		"summary": "Coordinated the execution of a full-cycle online/mobile contest on a short deadline and restricted budget for Rogers Chatr Wireless customers. The online portion of the contest allowed Rogers Chatr wireless customers to enter a valid Chatr phone number to participate in the contest and possibly win prizes. They would receive text messages if they won a prize or receive a number to enter into the web site.",
		"responsibilities": [
				"Lead developer of the project when the contest launched and maintained the site and reports while the contest was going on.",
				"Developed a complex algorithm to manage data duplication and prize allocation.",
				"Developed Q&A plan and benchmark measures to validate data integrity and guided our internal team in understanding complex requirements within the context of time and budget restraints.",
				"Created a complex backend routine to consume daily .csv data files with customer data through secure FTP connection in order to provide reporting of the contest to Chatr.",
				"Performed application troubleshooting and developed comprehensive reporting."
			],
		"tags": "C#, Javascript, CSS, HTML, SQL Server, XML",
		"feature": "featureChatr.jpg",
		"icon": "iconChatr.png",
		"sampleCode": "https://github.com/SpiritBreaker226/codesamples-Chatr",
		"TeamSize": 2,
		"Platforms": "Web",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2012-10-22",
		"projectEndDate": "2013-01-16"
	},
	{
		"name": "fRed.ca",
		"summary": "Custom social media network was developed for Ontario Liberal Party (fred.ca), where party members can join a certain group and message each other through an internal messaging system.",
		"responsibilities": [
				"Added group mechanism to allow users to communicate with each other.",
				"Developed event management system which allows OLP to solicit registrations from members and integrate with OLP internal payment engine.",
				"Created a points system to allow the users on the site to do some activities in order to collect points. For example, a user could refer a friend and receive 8 points."
			],
		"tags": "C#, Javascript, CSS3, HTML5, SQL Server",
		"feature": "featureFred.jpg",
		"icon": "iconFred.png",
		"sampleCode": "",
		"TeamSize": 7,
		"Platforms": "Web",
		"projectType": "Close",
		"projectURL": "http://fred.ca",
		"projectStartDate": "2010-10-12",
		"projectEndDate": "2012-03-22"
	},
	{
		"name": "Benjamin Memorial Chapel",
		"summary": "This is a popular Jewish funeral home website which is managed by our team.",
		"responsibilities": [
				"Assisted in developing the website",
				"Client wanted to have a newsletter detailing which services were going on at the chapel in the next 7 days. Reinstated and maintained the newsletter. Resulting in having over 1000 subscribers receiving this newsletter twice a day.",
				"On most Jewish Holidays, there is a message that needs to go up to website and newsletter, at different points during that holiday. Created a function using Test Driven Development to display a holiday message for a given time on both the website and newsletter. Resulting in less work in maintaining the website and newsletter during those days."
			],
		"tags": "C#, Javascript, CSS3, HTML5, SQL Server, Coldfusion",
		"feature": "featureBenjamin.jpg",
		"icon": "iconBenjamin.png",
		"sampleCode": "https://github.com/SpiritBreaker226/codesamples-Benjamins",
		"TeamSize": 3,
		"Platforms": "Web",
		"projectType": "Close",
		"projectURL": "http://benjaminsparkmemorialchapel.ca",
		"projectStartDate": "2007-09-10",
		"projectEndDate": "2014-08-18"
	},
	{
		"name": "Northcott",
		"summary": "Created an eShop app to allow the sales people to quickly place orders of fabric and designs, while they are with their customers in their shop or home.",
		"responsibilities": [
				"Lead Developer on the project",
				"Added in complex business rules from Northcott, for example, if a customer is in Canada, they have an option to buy all fabrics at half the quantity. However, this only applies to fabrics that are metre(s), if the fabric are inch(es) then they should be in the cart but at 0 quantity.",
				"Tied in the existing online ordering system which uses Java and ColdFusion, with the app which uses C#. By calling the page that is already being used for the online ordering, we were able to add in the items in the cart from the app, into the existing ordering system which resulted in having a unified ordering system."
			],
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, Phonegap",
		"feature": "featureNorthcott.jpg",
		"icon": "iconNorthcott.png",
		"sampleCode": "https://github.com/SpiritBreaker226/codesamples-Nothcott",
		"TeamSize": 2,
		"Platforms": "IOS",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2014-03-10",
		"projectEndDate": "2014-08-18"
	},
	{
		"name": "John Hancock: Retirement Plan Services",
		"summary": "A portal is created for each of the representatives, in order to allow the user to find a representative in their area, and get basic information on investments from them. Each representative has their own blog to inform the user what is happening at John Hancock.",
		"responsibilities": [
				"Lead Developer on the project.",
				"Created an instant search of all of the representatives in order for the user to quickly find their representative.",
				"Masterminded the implementation of the design and logistics of the blog.",
				"Reverse engineered in order to automatically add in new representatives newsletter and newsletter list in the blog because each representative has an email sent out every time a new post is added to their blog."
			],
		"tags": "#, Javascript, jQuery, CSS3, HTML5, SQL Server, DotNetNuke, PHP, mySQL, WordPress",
		"feature": "featureJH.jpg",
		"icon": "iconJH.png",
		"sampleCode": "",
		"TeamSize": 5,
		"Platforms": "Web",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2013-09-04",
		"projectEndDate": "2014-05-30"
	},
	{
		"name": "City of Vaughan",
		"summary": "An official app from City of Vaughan to allow its citizens to know what is going on in Vaughan, as well as contact information for their city hall.",
		"responsibilities": [
				"Lead Developer on the project.",
				"Redesigned the app, from the bottom up because of duplicated code, a slow user interface and hard to maintain, this resulted in a clearer code, quicker user interface and is now easier to maintain.",
				"Completed a Carousel for the homepage that will display feature event and news to the user when the app first loads, as well as created management system to allow the administrators at City of Vaughan to control what goes into the banner without having to resubmit the app to Apple's App Store and Google's Play Store.",
				"Constructed News and Event sections to bring in news and events from an admin site to allow the administrators to add or remove news or events from the app."
			],
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, Phonegap",
		"feature": "featureCityVaughan.jpg",
		"icon": "iconCityVaughan.png",
		"sampleCode": "https://github.com/SpiritBreaker226/codesamples-CityOfVaughan",
		"TeamSize": 2,
		"Platforms": "iOS & Android",
		"projectType": "Close",
		"projectURL": "http://itunes.apple.com/us/app/city-of-vaughan/id896731406",
		"projectStartDate": "2014-04-04",
		"projectEndDate": "2014-08-30"
	}
]