[
	{
		"name": "A Simple Chess Game (iOS)",
		"summary": "A simple chess game created for iOS devices",
		"description": "",
		"tags": "Objective-C, iOS",
		"feature": "featureASChess.png",
		"icon": "iconASChess.png",
		"sampleCode": "",
		"projectType": "Open",
		"projectURL": "",
		"projectStartDate": "2014-07-08T23:28:56.782Z",
		"projectEndDate": ""
	},
	{
		"name": "My Personal Site",
		"summary": "My Personal Blog & Portfolio Site",
		"description": "",
		"tags": "Javascript, CSS3, HTML5, jQuery, AngularJS, Bootstrap",
		"feature": "featureMySite.png",
		"icon": "iconMySite.png",
		"sampleCode": "",
		"projectType": "Open",
		"projectURL": "jstats.me",
		"projectStartDate": "2014-08-11T23:28:56.782Z",
		"projectEndDate": ""
	},
	{
		"name": "Elementary Teacher of Toronto",
		"summary": "",
		"description": "Worked with a partner company (design vendor) to develop the front end of the site using WordPress as the backbone, that supported the integration with their current organizational structure.  I developed the back end member data management system to support the growth and marketing initiatives of ETT organization and re-engineered WordPress so that multiple plugins can post onto the website.",
		"tags": "Wordpress, PHP, mySQL, Javascript, CSS, HTML",
		"feature": "featureETT.png",
		"icon": "iconETT.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "ett.ca",
		"projectStartDate": "2012-07-16T23:28:56.782Z",
		"projectEndDate": "2013-12-16T23:28:56.782Z"
	},
	{
		"name": "Oxford Properties Recycling Game (iOS)",
		"summary": "",
		"description": "Developed an iPad game for Oxford Properties to promote recycling and sustainability in their buildings. Was a sole developer responsible for implementation of the design, local database and game algorithm on a tight deadline. Developed deployment plan and trained the client on installation and reporting procedure. Trained junior developers on the game procedure and maintenance.",
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, Phonegap",
		"feature": "featureOxford.png",
		"icon": "iconOxford.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2011-11-01T23:28:56.782Z",
		"projectEndDate": "2014-08-18T23:28:56.782Z"
	},
	{
		"name": "GeriatRx Pharmacy (iOS)",
		"summary": "",
		"description": "Allows doctors to view a patient's history, drug interactions, as well as enter their patient's prescriptions all from a tablet. I worked on the styling and most of the coding. This app is able to search by patients name and by drugs. The doctor can authorised by signing a prescription on the app. An PDF is automatically sent out to the doctor and patient.",
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, Phonegap",
		"feature": "featureGeriatRx.png",
		"icon": "iconGeriatRx.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2013-04-03T23:28:56.782Z",
		"projectEndDate": "2014-04-21T23:28:56.782Z"
	},
	{
		"name": "Ontario Liberal Party",
		"summary": "",
		"description": "I executed the implementation of two new content managed websites for Ontario Liberal Party. Short timeline and rapid execution was performed to release the new website for September 2010 and September 2011. First website accommodated the Dot Net Nuke CMS engine and the second website performed custom integration with OLP internal web services that were utilized as data source. Also, on the second website, I read a non-web standard from their non-standard XML stream and converted it over to be read onto the website.",
		"tags": "C#, Javascript, CSS, HTML, SQL Server, DotNetNuke, XML",
		"feature": "featureOLP.png",
		"icon": "iconOLP.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "ontarioliberal.ca",
		"projectStartDate": "2010-08-04T23:28:56.782Z",
		"projectEndDate": "2011-09-04T23:28:56.782Z"
	},
	{
		"name": "theObituaries.ca",
		"summary": "Is a site that gives you the opportunity to create an obituary or memorial for a friend or family member.",
		"description": "Is a site that gives you the opportunity to create an obituary or memorial for a friend or family member. You can also share obituaries on Facebook or Twitter. My contribution to this project is I created an image uploader and manager component, that keeps track of the user's image that they uploaded for either their obituary or funeral home. I also created the approval process when a funeral home makes a change to their profile. It needs to be approved before it goes live to the site. This includes both text and images.",
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, DotNetNuke, PHP, mySQL, WordPress",
		"feature": "featureObituaries.png",
		"icon": "iconObituaries.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "theObituaries.ca",
		"projectStartDate": "2013-02-12T23:28:56.782Z",
		"projectEndDate": "2013-09-16T23:28:56.782Z"
	},
	{
		"name": "Chatr",
		"summary": "Coordinated the execution of a full-cycle online/mobile contest on a short deadline and restricted budget for Rogers Chatr Wireless customer.",
		"description": "Coordinated the execution of a full-cycle online/mobile contest on a short deadline and restricted budget for Rogers Chatr Wireless customer. The online portion of the contest allowed Rogers Chatr wireless customers to enter a valid Chatr phone number to participate in a contest and possibly win prizes. Proper text messages were distributed upon prize winning and bulk invitations were distributed. ImpactMobility was utilized as a 3rd party text message vendor. Complex back end routine was developed to consume daily .csv data files with customer data through secure FTP connection. A complex algorithm was developed to manage data duplication and prize allocation. Application troubleshooting was performed as needed and comprehensive reporting was developed as part of the project. Developed Q&A plan and benchmark measures to validate data integrity and guided our internal team in understating complex requirements with the context of time and budget restraint in mind.",
		"tags": "C#, Javascript, CSS, HTML, SQL Server, XML",
		"feature": "featureChatr.png",
		"icon": "iconChatr.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2012-10-22T23:28:56.782Z",
		"projectEndDate": "2013-01-16T23:28:56.782Z"
	},
	{
		"name": "fRed.ca",
		"summary": "Custom social media network was developed for Ontario Liberal Party (fred.ca)",
		"description": "Custom social media network was developed for Ontario Liberal Party (fred.ca) where party members can join a certain group and message each other through an internal messaging system. Also allows administrator to push messages through to all registered members. Group mechanism allows users to communicate with each other. Event management system allows OLP to solicit registrations from members and integrate with OLP internal payment engine. This social media network supports over 10,000 members and the number is continuously growing.",
		"tags": "C#, Javascript, CSS3, HTML5, SQL Server",
		"feature": "featureFred.png",
		"icon": "iconFred.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "fRed.ca",
		"projectStartDate": "2010-10-12T23:28:56.782Z",
		"projectEndDate": "2012-03-22T23:28:56.782Z"
	},
	{
		"name": "Benjamin Memorial Chapel",
		"summary": "This is a popular Jewish funeral home website which is managed by our team.",
		"description": "This is a popular Jewish funeral home website which is managed by our team. I assisted in developing the website ASP.net. We are responsible for content and updates to the site regarding current services, Shiva and unveilings. We are also responsible for the eBlast going out to users on the website twice each day.",
		"tags": "C#, Javascript, CSS3, HTML5, SQL Server, Coldfusion",
		"feature": "featureBenjamin.png",
		"icon": "iconBenjamin.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "benjaminsparkmemorialchapel.ca",
		"projectStartDate": "2007-09-10T23:28:56.782Z",
		"projectEndDate": "2014-08-18T23:28:56.782Z"
	},
	{
		"name": "Northcott (iOS)",
		"summary": "",
		"description": "Created a eShop app to allow the sales people to quickly place orders of fabric and designs while they our with their customers in their shop or home.",
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, Phonegap",
		"feature": "featureNorthcott.png",
		"icon": "iconNorthcott.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2014-03-10T23:28:56.782Z",
		"projectEndDate": "2014-08-18T23:28:56.782Z"
	},
	{
		"name": "Arthritis Society",
		"summary": "Created an internal management system to keep track of patient progress and what treatment they are currently using. The system will notify the doctor of the progress of the patient",
		"description": "Created an internal management system to keep track of patient progress and what treatment they are currently using. The system will notify the doctor of the progress of the patient",
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, Phonegap",
		"feature": "featureArthritis.png",
		"icon": "iconArthritis.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2010-09-04T23:28:56.782Z",
		"projectEndDate": "2010-09-30T23:28:56.782Z"
	},
	{
		"name": "John Hancock: Retirement Plan Services",
		"summary": "A portal is created for each of the representatives, in order to allow the user find a representative in their area, and get the basic information on investments from their.",
		"description": "A portal is created for each of the representatives, in order to allow the user find a representative in their area, and get the basic information on investments from their. Also, each representative has their blog in order inform the user what is happening at John Hancock. Furthermore, did some reversed engineering in order to automatically adding in new  representatives newsletter and newsletter list in the blog because each representative has an email sent out every time a new post is added to their blog.",
		"tags": "#, Javascript, jQuery, CSS3, HTML5, SQL Server, DotNetNuke, PHP, mySQL, WordPress",
		"feature": "featureJH.png",
		"icon": "iconJH.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "",
		"projectStartDate": "2013-09-04T23:28:56.782Z",
		"projectEndDate": "2014-05-30T23:28:56.782Z"
	},
	{
		"name": "City of Vaughan (iOS)",
		"summary": "",
		"description": "",
		"tags": "C#, Javascript, jQuery, CSS3, HTML5, SQL Server, Phonegap",
		"feature": "",
		"icon": "iconCityVaughan.png",
		"sampleCode": "",
		"projectType": "Close",
		"projectURL": "itunes.apple.com/us/app/city-of-vaughan/id896731406",
		"projectStartDate": "2014-04-04T23:28:56.782Z",
		"projectEndDate": "2014-08-30T23:28:56.782Z"
	}
]